Дошкольное_учреждение83/src/InformationRegisters/удуНедоступныеМетодическиеМатериалы/удуНедоступныеМетодическиеМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуНедоступныеМетодическиеМатериалы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЕдиница</name>
    <type>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуНедоступныеМетодическиеМатериалы/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.ТекстЗапроса = "
		|ВЫБРАТЬ
		|	РегистрСведенийудуНедоступныеМетодическиеМатериалы.ИнвентарныйНомер,
		|	РегистрСведенийудуНедоступныеМетодическиеМатериалы.УчетнаяЕдиница,
		|	РегистрСведенийудуНедоступныеМетодическиеМатериалы.Дата,
		|	РегистрСведенийудуНедоступныеМетодическиеМатериалы.Примечание
		|ИЗ
		|	РегистрСведений.удуНедоступныеМетодическиеМатериалы КАК РегистрСведенийудуНедоступныеМетодическиеМатериалы
		|";	
	
КонецПроцедуры
